# DivisionPattern Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DivisionPattern Property
ParameterTypeId Class See Also
---
"Division Pattern"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DivisionPattern { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DivisionPattern As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DivisionPattern {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace